Autodesk.Revit.DB.FamilySymbolSet
A set that can contain family symbols.

Autodesk.Revit.DB.FamilySymbolSet.Insert(Autodesk.Revit.DB.FamilySymbol)
System.Int32
Insert the specified family symbol into the set.
item: The symbol to be inserted into the set.
Returns: Returns whether the symbol was inserted into the set.

Autodesk.Revit.DB.FamilySymbolSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.FamilySymbolSet.ReverseIterator
Autodesk.Revit.DB.FamilySymbolSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.FamilySymbolSet.ForwardIterator
Autodesk.Revit.DB.FamilySymbolSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.FamilySymbolSet.Erase(Autodesk.Revit.DB.FamilySymbol)
System.Int32
Removes a specified family symbol from the set.
item: The symbol to be erased.
Returns: The number of symbols that were erased from the set.

Autodesk.Revit.DB.FamilySymbolSet.Contains(Autodesk.Revit.DB.FamilySymbol)
System.Boolean
Tests for the existence of a family symbol within the set.
item: The symbol to be searched for.
Returns: The Contains method returns True if the symbol is within the set, otherwise False.

Autodesk.Revit.DB.FamilySymbolSet.Clear
void
Removes every symbol from the set, rendering it empty.

Autodesk.Revit.DB.FamilySymbolSet.Size
System.Int32
get
Returns the number of family symbols that are in the set.

Autodesk.Revit.DB.FamilySymbolSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.